"""
Дан список [0,5,2,4,7,1,3,19]. Написать программу для подсчета нечетных цифр в нем.
"""


a = [0, 5, 2, 4, 7, 1, 3, 19]
count = 0
for element in a:
     if element % 2 != 0:
          count = count + 1
print("Количество нечетных цифр - ", count)
